<?php
$citysOfRus = [
    'Иркутская область' => ['Иркутск', 'Братск', 'Ангарск'],
    'Тульская область' => ['Тула', 'Новомосковск', 'Донской'],
    'Белгородская область' => ['Белгород', 'Старый Оскол', 'Губкин', 'Шебекино'],
    'Тамбовская область' => ['Тамбов', 'Мичуринск', 'Рассказово'],
    'Самарская область' => ['Самара', 'Тольятти', 'Сызрань', 'Новокуйбышевск'],
    'Краснодарский край' => ['Краснодар', 'Сочи', 'Новороссийск', 'Армавир']
];
$str = '';
foreach ($citysOfRus as $key => $value) {
    $str .= $key . ':<br>';
    foreach ($value as $item) {
        if (mb_substr($item, 0, 1, "UTF-8") == 'К') {
            $str .= $item . ', ';
        }
    }
    $str = rtrim($str, ", ");
    $str .= '<br>';
//    $str .= implode(", ", $value) . '<br>';
}

echo $str;